utilities/1DFlameSin2Foam/2D_syngas_premixed/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   psi;
}

chemistry       on;

initialChemicalTimeStep 1e-8;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          seulex;
    absTol          1e-12;
    relTol          1e-1;
}

#include "reactions"

// ************************************************************************* //
differentialDiffusion on;
thermalDiffusion off;

Prt  Prt [0 0 0 0 0] 0.7;
Sct  Sct [0 0 0 0 0] 0.7;
