utilities/1DFlameSin2Foam/2D_syngas_premixed/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    patch0_half0
    {
        type            empty;
    }
    patch0_half1
    {
        type            empty;
    }
    patch1_half0
    {
        type           pressureInletOutletVelocity;
        value          uniform (0 0 0);           
    } 
    patch1_half1
    {
        type           pressureInletOutletVelocity;
        value          uniform (0 0 0);         
    } 
    patch2_half0
    {
        type           pressureInletOutletVelocity;
        value          uniform (0 0 0);         
    }  
    patch2_half1
    {
        type           pressureInletOutletVelocity;
        value          uniform (0 0 0);         
    }  
}

